{
  "backend/main.mo": "Main Motoko actor defining the membership registry with persistent state for members and user profiles, access-control authorization, and CRUD operations including addMember, bulkAddMembers, getAllMembers, updateMember, and deleteMember with per-year membership boolean and receipt fields.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing their roles in the membership registration app.",
  "frontend/index.css": "Tailwind CSS base file defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, primary, destructive, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Sets up TanStack Router with a root layout route wrapping Register, Members, and Bulk Upload pages, and redirects the index path to /register.",
  "frontend/src/components/Layout.tsx": "App shell component rendering a sticky header with navigation links, a main content area, and a footer with copyright and caffeine.ai attribution.",
  "frontend/src/components/MemberCard.tsx": "Card component that displays a member's details including contact info, address, spouse, family count, and active membership year badges with optional receipt numbers shown inline.",
  "frontend/src/components/MemberList.tsx": "Fetches all members via React Query and renders a responsive grid of MemberCards filtered client-side by a search query, with distinct loading, error, empty, and no-results states.",
  "frontend/src/components/MembershipForm.tsx": "A React form component for adding a single membership record, including fields for personal info, yearly membership checkboxes (2021–2030), and receipt numbers, with validation and submission via the useAddMember mutation hook.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using the current Internet Identity, initializing admin access control via a URL secret parameter and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching all members (useGetAllMembers), adding a single member (useAddMember), and bulk-adding members (useBulkAddMembers) via the backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, sets up Tailwind directives, and defines light and dark mode CSS custom properties for the app's color palette and UI tokens.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider, mounting it to the root DOM element.",
  "frontend/src/pages/BulkUploadPage.tsx": "A page component that allows users to upload a CSV file to bulk-import membership records, parsing and validating rows client-side before submitting valid entries via the useBulkAddMembers mutation hook.",
  "frontend/src/pages/MembersPage.tsx": "Displays a paginated/searchable membership list with a header, search input, and a button to download all members as a CSV file. Fetches members via `useGetAllMembers` and generates CSV with all yearly payment fields.",
  "frontend/src/pages/RegisterPage.tsx": "Renders the member registration page with a banner image and a card-wrapped `MembershipForm` component for adding new members.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions to read, persist, and clear URL parameters from both query strings and hash-based routes, using sessionStorage for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Inter, Playfair Display), OKLCH-based semantic color tokens, border radii, box shadows, and accordion keyframe animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the overall project state (version 27) for the AVT Vashi membership registration app, including architectural notes, existing features, and known issues such as the hidden download button and bulk upload authorization error."
}