{
  "kind": "build_request",
  "title": "Fix Download Database button visibility on Members page",
  "projectName": "AVT Vashi Member Registration",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-30",
      "text": "Fix the 'Download Database' button on the MembersPage so it is visible and accessible to the user. Ensure the button renders correctly in the page header area alongside the page title, is styled consistently with the app's design theme, and triggers a CSV download of all member records with columns: Membership Number, Name, Mobile No, Alternate Mobile, Address, Area, Spouse Name, Family Member Count.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Not able to see database download option"
        ]
      },
      "acceptanceCriteria": [
        "The 'Download Database' button is visible on the Members page without any scrolling or interaction required to reveal it.",
        "The button is positioned in the page header area, clearly associated with the members list.",
        "Clicking the button downloads a CSV file containing all currently loaded member records.",
        "The CSV file includes the columns: Membership Number, Name, Mobile No, Alternate Mobile, Address, Area, Spouse Name, Family Member Count.",
        "The button is styled consistently with the rest of the app's design system (colors, typography, spacing).",
        "The button remains visible and functional whether the members list is empty, loading, or populated."
      ]
    }
  ],
  "constraints": [
    "Do not change backend logic or data models.",
    "CSV download must be performed client-side using already-fetched data — no new backend calls required."
  ],
  "nonGoals": [
    "Adding new export formats (e.g., Excel, PDF).",
    "Adding server-side export functionality.",
    "Changing the columns included in the CSV export."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}